"""
Напишите программу определяющую допуск ученика к зачету.
Программа должна запрашивать число учеников, затем у каждого ученика запрашивать балл за финальный тест
и в ответ печатать, допущен ли он (True или False) к зачету (необходимо набрать больше 50 баллов).
Ученикам без допуска должно печататься "Вы отчислены".
Выдачу допуска реализуй как функцию.
"""


def F(n):
    if n <= 50:
        print('False', 'Вы отчислены')
    if n > 50:
        print('True')


Hehe = int(input())
for i in range(Hehe):
    a = int(input())
    print(F(a))
