"""
В каждом заплыве участвуют два случайных спортсмена из разных сборных. Напиши программу для печати номеров спортсменов.
1) Программа должна запрашивать количество спортсменов в каждой сборной с сообщением: «Число участников сборной _:».
2) Затем должна печататься пара случайных спортсменов из разных сборных для заплыва в формате: «Пловец _ - пловец _».
"""
from random import *
a1 = int(input('Введите кол-во участников Из сборной 1:'))
b1 = int(input('Введите кол-во участников Из сборной 2:'))
a = randint(0, a1)
b = randint(0, b1)
if a == b:
    a = randint(0, a1)
    b = randint(0, b1)
print('Спортсмен из сборной 1:', a, 'Спортсмен из сборной 2:', b)