"""
На летней универсиаде будет проводиться по два забега. Чтобы соревнования были честными,
участники должны распределяться между забегами случайным образом.
Напишите программу, печатающую случайные номера забегов (1 или 2) до тех пор, пока не будет введено «off».
После генерации каждого номера должно печататься:
1) «Ваш номер: _».
2) «Участников в первом забеге: _», «Участников во втором забеге: _».
"""
from random import *
k1 = 0
k2 = 0
while True:
    a = input('Введите off чтобы выключить, введите enter чтобы протолжить:')
    if a == 'off':
        break
    b = randint(0, 1)
    print('ваш номер:', b)
    if b == 0:
        k1 += 1
    else:
        k2 += 1
    print('В первом забеге:', k1, 'Во втором забеге:', k2)